# Лабораторна робота №1

## Вступне заняття. Налаштування середовища розробки Python 3 і запуск програм

### Мета роботи – ознайомитися інструментарієм розробки веб-додатків.

### Завдання
1. Навчитися встановлювати середовище розробки Python 3 в різних операційних системах і запускати програми.
2. Написати базову програму згідно виданого завдання та проаналізувати її роботу.
3. На прикладі написаної програми навчитися застосовувати систему Git для контролю версій програмного забезпечення.

#### Хід роботи
1. Склоновуємо головний репозиторій за допомогою команди **git clone**.
2. Створюємо власну гілку
3. Створюємо просту пайтон програму
4. Пушимо наші зміни на **Github**


#### Висновок
Ми навчились налаштовувати середовище розробки, створювати власну гілку і пушити зміни на віддалений репозиторій. 